---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.CorruptModelException
source: html/f996b401-c8c5-4c0d-856f-8d6090caea60.htm
---
# CorruptModelException Methods

Retrieves data needed to serialize the target object.